/* структура
Классы
сад{
	Деревья(10 яблонь, 15 груш)
			f добавить дерево
			f Собирать плоды со всех деревьев, добавленных в сад
			f Подсчитывать общее кол-во собранных плодов для каждого типа деревьев
			f *Необязательно к выполнению: система может посчитать общий вес собранных фруктов каждого вида 
}

Дерево{
	Уникальный номер(i++)
	Вид(груша, яблоня)
	Плод(груша, яблоко)
	Урожайность
		груш (0-20)
		яблок (40-50)

}

Плод{
	масса
		груши (150 - 180)
		яблок (130 - 170)
}

Система должна добавить деревья сад;
Произвести сбор продукции со всех деревьев;
Вывести на экран общее кол-во собранных фруктов каждого вида.

*/